"""Программа принимает действительное положительное число x и целое отрицательное число y.
Необходимо выполнить возведение числа x в степень y.
Задание необходимо реализовать в виде функции my_func(x, y).
При решении задания необходимо обойтись без встроенной функции возведения числа в степень.

Подсказка: попробуйте решить задачу двумя способами.
Первый — возведение в степень с помощью оператора **.
Второй — более сложная реализация без оператора **, предусматривающая использование цикла."""

def my_pow(x,y):
    result = 1 / (x ** abs(y))
    return result

print(my_pow(5, -2))

def my_pow_1(x,y):
    n = 0
    while n <= abs(y):
        result = 1 / (result * x)
        n += 1
    return result

print(my_pow(5, -2))